
## Plan Result (prod_dns)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.adguard_gamora.adguard_config.config


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.adguard_gamora.adguard_config.config is tainted, so must be replaced
-/+ resource "adguard_config" "config" {
      - blocked_services                = [] -> null
      ~ dns                             = {
          - allowed_clients            = [] -> null
          ~ bootstrap_dns              = [
              - "9.9.9.10",
              - "149.112.112.10",
              - "2620:fe::10",
              - "2620:fe::fe:10",
              + "1.1.1.1",
              + "1.0.0.1",
            ]
          - disallowed_clients         = [] -> null
          + fallback_dns               = [
              + "https://1.1.1.1/dns-query",
              + "https://1.0.0.1/dns-query",
            ]
          ~ rate_limit                 = 20 -> 30
          ~ upstream_dns               = [
                "https://dns10.quad9.net/dns-query",
              + "[/*.home.bancey.xyz/]10.151.14.1",
            ]
            # (22 unchanged attributes hidden)
        }
      ~ id                              = "1" -> (known after apply)
      ~ last_updated                    = "Monday, 28-Apr-25 20:35:02 UTC" -> (known after apply)
      ~ stats                           = {
          ~ interval = 24 -> 168
            # (2 unchanged attributes hidden)
        }
      ~ tls                             = {
          ~ dns_names          = [] -> (known after apply)
          ~ issuer             = null -> (known after apply)
          ~ key_type           = null -> (known after apply)
          ~ not_after          = null -> (known after apply)
          ~ not_before         = null -> (known after apply)
          ~ private_key_saved  = false -> (known after apply)
          ~ subject            = null -> (known after apply)
          ~ valid_cert         = false -> (known after apply)
          ~ valid_chain        = false -> (known after apply)
          ~ valid_key          = false -> (known after apply)
          ~ valid_pair         = false -> (known after apply)
          ~ warning_validation = null -> (known after apply)
            # (9 unchanged attributes hidden)
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":550,"Program":"tfcmt","SHA1":"","Target":"prod_dns","Vars":{}} -->